## 🏗️ [OpenTofu plan](https://opentofu.org)

Changes were detected in the OpenTofu plan. Please review the changes below.

<details>
<summary>
<code>make opentofu-plan</code>
</summary>

```tf
module.talos_cluster["hel01"].talos_machine_secrets.secret_bundle: Refreshing state... [id=machine_secrets]
module.talos_cluster["hel01"].data.talos_client_configuration.this: Reading...
module.talos_cluster["hel01"].data.talos_client_configuration.this: Read complete after 0s [id=hel01]
module.talos_cluster["hel01"].data.talos_machine_configuration.controlplane["antelope.nicklasfrahm.dev"]: Reading...
module.talos_cluster["hel01"].data.talos_machine_configuration.controlplane["antelope.nicklasfrahm.dev"]: Read complete after 0s [id=hel01]
module.talos_cluster["hel01"].talos_machine_configuration_apply.controlplane["antelope.nicklasfrahm.dev"]: Refreshing state... [id=machine_configuration_apply]
module.talos_cluster["hel01"].talos_machine_bootstrap.controlplane["antelope.nicklasfrahm.dev"]: Refreshing state... [id=machine_bootstrap]
module.talos_cluster["hel01"].talos_cluster_kubeconfig.this: Refreshing state... [id=lab01]
helm_release.authz: Refreshing state... [id=authz]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # helm_release.authz will be updated in-place
  ~ resource "helm_release" "authz" {
      ~ id                         = "authz" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.1.0" -> (known after apply)
          ~ chart          = "authz" -> (known after apply)
          ~ first_deployed = 1743631428 -> (known after apply)
          ~ last_deployed  = 1743631428 -> (known after apply)
          ~ name           = "authz" -> (known after apply)
          ~ namespace      = "kube-system" -> (known after apply)
          ~ notes          = <<-EOT
                Successfully configured admin access for the following users:
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "0.1.0" -> (known after apply)
        } -> (known after apply)
        name                       = "authz"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (26 unchanged attributes hidden)
    }

  # module.talos_cluster["hel01"].talos_machine_configuration_apply.controlplane["antelope.nicklasfrahm.dev"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "controlplane" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
╷
│ Warning: UpgradeState Triggered
│ 
│   with helm_release.authz,
│   on main.tf line 61, in resource "helm_release" "authz":
│   61: resource "helm_release" "authz" {
│ 
│ Successfully migrated state from SDKv2 to Plugin Framework
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: opentofu.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "opentofu.tfplan"
```

</details>